CSI API ETABS v1

# cAreaObjSetMass Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int SetMass(
    	string Name,
    	double MassOverL2,
    	bool Replace = false,
    	eItemType ItemType = eItemType.Objects
    )

    Function SetMass (
    	Name As String,
    	MassOverL2 As Double,
    	Optional Replace As Boolean = false,
    	Optional ItemType As eItemType = eItemType.Objects
    ) As Integer

    Dim instance As cAreaObj
    Dim Name As String
    Dim MassOverL2 As Double
    Dim Replace As Boolean
    Dim ItemType As eItemType
    Dim returnValue As Integer

    returnValue = instance.SetMass(Name, MassOverL2,
    	Replace, ItemType)

    int SetMass(
    	String^ Name,
    	double MassOverL2,
    	bool Replace = false,
    	eItemType ItemType = eItemType::Objects
    )

    abstract SetMass :
            Name : string *
            MassOverL2 : float *
            ?Replace : bool *
            ?ItemType : eItemType
    (* Defaults:
            let _Replace = defaultArg Replace false
            let _ItemType = defaultArg ItemType eItemType.Objects
    *)
    -> int

#### Parameters

Name

    Type: SystemString

MassOverL2

    Type: SystemDouble

Replace (Optional)

    Type: SystemBoolean

ItemType (Optional)

    Type: ETABSv1eItemType

#### Return Value

Type: Int32

See Also

#### Reference

cAreaObj Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com